import torch
from transformers import ElectraForQuestionAnswering, AutoTokenizer



modelName = 'model_files/'
model = ElectraForQuestionAnswering.from_pretrained(modelName)
tokenizer = AutoTokenizer.from_pretrained(modelName)

question = "ما هو علم الحاسوب بشكل دقيق؟" 
text = "علم الحاسوب أو علوم الكمبيوتر هو دراسة العمليات التي تتفاعل مع البيانات والتي يمكن تمثيلها كبيانات في شكل برامج. يتيح استخدام الخوارزميات لمعالجة المعلومات الرقمية وتخزينها وإبلاغها. يدرس عالم الحاسوب نظرية الحوسبة وممارسة تصميم أنظمة البرمجيات.يمكن تقسيم مجالاتها إلى التخصصات النظرية والعملية. نظرية التعقيد الحسابي هي مجردة للغاية، في حين أن رسومات الحاسوب تؤكد على التطبيقات الواقعية. تنظر نظرية لغة البرمجة في مناهج وصف العمليات الحسابية، بينما تتضمن برمجة الحاسوب نفسها استخدام لغات البرمجة والأنظمة المعقدة. يعتبر التفاعل بين الإنسان والحاسوب من أبرز التحديات في جعل أجهزة الحاسوب مفيدة وقابلة للاستخدام ويمكن الوصول إليها.ويتم تعريف علم الحاسوب بشكل دقيق على أنه علم يختص بالقدرة على تطبيق المعرفة الناتجة من الحاسوب والرياضيات على جميع فروع المعرفة، والقدرة على تحليل أي مشكلة وتحديد المتطلبات لها باستخدام الحاسوب لوضع الحل المناسب، والقدرة على تصميم وتنفيذ وتقييم النظام القائم على الحاسوب والعمليات والبرنامج لتلبية الاحتياجات المطلوبة، ويسهل القدرة على العمل بفعالية في فرق ومجموعات لتحقيق هدف مشترك"
input = tokenizer(question, text,  return_tensors="pt")
output = model(**input)
start_index = output.start_logits.argmax()
end_index = output.end_logits.argmax() + 1

answer = tokenizer.decode(input.input_ids[0, start_index:end_index],skip_special_tokens=True)
print(answer)
